update readme file with proper project discription
